Repository: aycabas/kiota
Catalog: src/Kiota.Web/Shared/GitHubSignIn.*.resx
Languages: fr

# SignIn
source: Sign In with GitHub
fr: Se connecter à GitHub

# SignOut
source: Sign Out from GitHub
fr: Se déconnecter de GitHub

# PersonalAccessTokenInstructionsStep1
source: Open a new tab to create a personal access token.
fr: Ouvrez un nouvel onglet afin de créer un nouveau jeton d'accès.

# PersonalAccessTokenInstructionsStep2
source: Give a name to the new access token.
fr: Donnez un nom au nouveau jeton.

# PersonalAccessTokenInstructionsStep3
source: Select the resource owner for the repository containing the definitions.
fr: Sélectionnez le propriétaires du repository qui contient les définitions.

# PersonalAccessTokenInstructionsStep4
source: Optional. Authenticate with the selected resource if requested.
fr: Optionel. Authentifiez vous auprès de la resource sélectionnée si demandé.

# PersonalAccessTokenInstructionsStep5
source: Under "repository access", select "All repositories" or "Only select repositories".
fr: Sous "accès au repository", sélectionnez "Tous les repositories" ou "Uniquement les repositories sélectionnés".

# PersonalAccessTokenInstructionsStep6
source: Under "repository permissions" select "contents" to "read-only".
fr: Sous "permissions du repository" sélectionnez "contenu" puis "lecture simple".

# PersonalAccessTokenInstructionsStep7
source: Click on "Generate Token".
fr: Cliquez sur "Générer le jeton".

# PersonalAccessTokenInstructionsStep8
source: Copy the generated token down below.
fr: Copiez le jeton généré ci-dessous.

# PersonalAccessTokenDescription
source: The personal access token is only ever sent to GitHub REST API.
fr: Le jeton est uniquement envoyé à l'API REST GitHub.

source: Personal Access Token
fr: Jeton d'accès personnalisé

# PersonalAccessTokenHeader
source: Sign in to GitHub with a Personal Access Token
fr: Connectez vous à GitHub à l'aide d'un jeton d'accès personnel

# SVGAltText
source: GitHub Octocat logo
fr: Logo GitHub Octocat

# ToolTip
source: Access private API descriptions.
fr: Accédez à des description d'APIs privées.
